In [1]:
import numpy as np
import pandas as pd

In [2]:
#series

In [3]:
labels = ['a','b','c']
minha_lista = [10,20,30]

In [4]:
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [5]:
pd.Series(['ueda','anderson','miura','sandro'])

0        ueda
1    anderson
2       miura
3      sandro
dtype: object

In [6]:
pd.Series(data=minha_lista,index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int32

In [9]:
ser1 = pd.Series([1,2,3,4],index=['EUA','Alemanha','Russia','Japão'])

In [10]:
ser1

EUA         1
Alemanha    2
Russia      3
Japão       4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,3,4],index=['Brasil','Alemanha','EUA','Japão'])

In [12]:
ser2

Brasil      1
Alemanha    2
EUA         3
Japão       4
dtype: int64

In [13]:
ser1 + ser2

Alemanha    4.0
Brasil      NaN
EUA         4.0
Japão       8.0
Russia      NaN
dtype: float64

In [14]:
#no python o nulo é None
#no pandas do python o nulo é NaN

In [ ]:
#dataframe
#é um conjunto de series

In [17]:
#para gerar numeros aleatórios controlados
np.random.seed(101)

In [18]:
df = pd.DataFrame(data=np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
pd.DataFrame(data=np.random.randn(5,4),columns='W X Y Z'.split())

          W         X         Y         Z
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [22]:
#select w from df

In [23]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [25]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [26]:
type(df)

pandas.core.frame.DataFrame

In [27]:
type(df['W'])

pandas.core.series.Series

In [28]:
#select X, Y, Z from df

In [29]:
df[['X','Y','Z']]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [30]:
colunas = ['Y','X','W']

In [31]:
df[colunas]

          Y         X         W
A  0.907969  0.628133  2.706850
B -0.848077 -0.319318  0.651118
C  0.528813  0.740122 -2.018168
D -0.933237 -0.758872  0.188695
E  2.605967  1.978757  0.190794

In [ ]:
#modo semelhante ao sql

In [32]:
df.X

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [33]:
df.Y

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df['nova_coluna']  = df['W'] + df['Z']

In [40]:
df['nova_coluna'] = 0

In [42]:
df['XXX'] = 'asdnasdj'

In [43]:
df

          W         X         Y         Z       NEW  nova_coluna       XXX
A  2.706850  0.628133  0.907969  0.503826  3.210676            0  asdnasdj
B  0.651118 -0.319318 -0.848077  0.605965  1.257083            0  asdnasdj
C -2.018168  0.740122  0.528813 -0.589001 -2.607169            0  asdnasdj
D  0.188695 -0.758872 -0.933237  0.955057  1.143752            0  asdnasdj
E  0.190794  1.978757  2.605967  0.683509  0.874303            0  asdnasdj

In [54]:
df = df.drop('NEW',axis=1)

In [55]:
df

          W         X         Y         Z  nova_coluna
A  2.706850  0.628133  0.907969  0.503826            0
B  0.651118 -0.319318 -0.848077  0.605965            0
C -2.018168  0.740122  0.528813 -0.589001            0
D  0.188695 -0.758872 -0.933237  0.955057            0
E  0.190794  1.978757  2.605967  0.683509            0

In [ ]:
df = df.drop('NEW',axis=1)

In [ ]:
df

In [ ]:
#dataframe são imutáveis, ou você usa o inplace ou você joga tudo em  uma variável
x

In [56]:
df.drop('nova_coluna',axis=1, inplace=True)

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#acessar os elementos específicos de um dataframe

In [58]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [59]:
df.loc['A','W']

2.706849839399938

In [60]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [61]:
df.iloc[0][0]

2.706849839399938

In [62]:
df.iloc[:2][1:]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965

In [63]:
df.W[0]

2.706849839399938

In [ ]:
#usando algo semelhante ao WHERE do SQL

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df > 1

       W      X      Y      Z
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True   True  False

In [66]:
df + 10

           W          X          Y          Z
A  12.706850  10.628133  10.907969  10.503826
B  10.651118   9.680682   9.151923  10.605965
C   7.981832  10.740122  10.528813   9.410999
D  10.188695   9.241128   9.066763  10.955057
E  10.190794  11.978757  12.605967  10.683509

In [67]:
df * 2

          W         X         Y         Z
A  5.413700  1.256265  1.815939  1.007652
B  1.302236 -0.638636 -1.696154  1.211931
C -4.036336  1.480244  1.057627 -1.178001
D  0.377391 -1.517744 -1.866474  1.910113
E  0.381589  3.957515  5.211935  1.367018

In [68]:
df / 3

          W         X         Y         Z
A  0.902283  0.209378  0.302656  0.167942
B  0.217039 -0.106439 -0.282692  0.201988
C -0.672723  0.246707  0.176271 -0.196334
D  0.062898 -0.252957 -0.311079  0.318352
E  0.063598  0.659586  0.868656  0.227836

In [69]:
df + df

          W         X         Y         Z
A  5.413700  1.256265  1.815939  1.007652
B  1.302236 -0.638636 -1.696154  1.211931
C -4.036336  1.480244  1.057627 -1.178001
D  0.377391 -1.517744 -1.866474  1.910113
E  0.381589  3.957515  5.211935  1.367018

In [70]:
bol = df > 0

In [71]:
bol

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [72]:
df[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [74]:
df[(df['W'] > 0) & (df['Y'] > 1) ]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df[(df['W'] > 0) | (df['Y'] > 1) ]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [76]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#

In [94]:
col = 'RS SP MG AM SC'.split()

In [95]:
col

['RS', 'SP', 'MG', 'AM', 'SC']

In [96]:
df

          W         X         Y         Z Estados
A  2.706850  0.628133  0.907969  0.503826      RS
B  0.651118 -0.319318 -0.848077  0.605965      SP
C -2.018168  0.740122  0.528813 -0.589001      MG
D  0.188695 -0.758872 -0.933237  0.955057      AM
E  0.190794  1.978757  2.605967  0.683509      SC

In [97]:
df['Estados'] = col

In [98]:
df

          W         X         Y         Z Estados
A  2.706850  0.628133  0.907969  0.503826      RS
B  0.651118 -0.319318 -0.848077  0.605965      SP
C -2.018168  0.740122  0.528813 -0.589001      MG
D  0.188695 -0.758872 -0.933237  0.955057      AM
E  0.190794  1.978757  2.605967  0.683509      SC

In [99]:
df.set_index('Estados')

                W         X         Y         Z
Estados
RS       2.706850  0.628133  0.907969  0.503826
SP       0.651118 -0.319318 -0.848077  0.605965
MG      -2.018168  0.740122  0.528813 -0.589001
AM       0.188695 -0.758872 -0.933237  0.955057
SC       0.190794  1.978757  2.605967  0.683509